app/Http/Controllers/User/TagihanController.php

    public function index(Request $request)
    {
        $models = Model::latest();
        if ($request->filled('bulan')) {
            $models->whereMonth('tanggal_tagihan', $request->bulan);
        }
        if ($request->filled('tahun')) {
            $models->whereYear('tanggal_tagihan', $request->tahun);
        }
        if ($request->filled('status')) {
            $models->where('status', $request->status);
        }
        if ($request->filled('biaya_id')) {
            $models->where('biaya_id', $request->biaya_id);
        }
        if ($request->filled('q')) {
            $models->search($request->q, null, true);
        }
        return view('user.' . $this->viewIndex, [
            'models' => $models->paginate(settings()->get('app_pagination', '20')),
            'routePrefix' => $this->routePrefix,
            'title' => 'DATA TAGIHAN',
            'biayaList' => Biaya::whereNull('parent_id')->pluck('nama', 'id'),
        ]);
---
select count(*) as aggregate from `tagihans` where year(`tanggal_tagihan`) = '2023' and `biaya_id` = '11'
select `nama`, `id` from `biayas` where `parent_id` is null

    public function show(Request $request, $id)
    {
        $tahun = $request->tahun;
        if ($request->bulan < bulanSpp()[0]) {
            $tahun = $tahun - 1;
        }
        $arrayData = [];
        foreach (bulanSPP() as $bulan) {
            if ($bulan == 1) {
                $tahun = $tahun + 1;
            }

            $tagihan = Model::where('siswa_id', $request->siswa_id)
                ->whereMonth('tanggal_tagihan', $bulan)
                ->whereYear('tanggal_tagihan', $tahun)
                ->first();
---
select * from `tagihans` where `siswa_id` = '366' and month(`tanggal_tagihan`) = '07' and year(`tanggal_tagihan`) = '2023' limit 1

        }
        $data['kartuSpp'] = collect($arrayData);

        $tagihan = Model::with('pembayaran')->findOrFail($id);
---
select * from `pembayarans` where `pembayarans`.`tagihan_id` in (514)