app/Models/Pembayaran.php

select * from `tagihans` where `tagihans`.`id` = 514 limit 1
---
    protected static function booted()
    {
        static::creating(function ($pembayaran) {
            $pembayaran->user_id = auth()->user()->id;
        });
        static::updating(function ($pembayaran) {
            $pembayaran->user_id = auth()->user()->id;
        });
        static::created(function ($pembayaran) {
            $pembayaran->tagihan->updateStatus();
        });
        static::updated(function ($pembayaran) {
            $pembayaran->tagihan->updateStatus();
        });
        static::deleted(function ($pembayaran) {
            // ubah status tagihan
            $pembayaran->tagihan->updateStatus();

            // if pembayaran == 'tf' hapus bukti bayar
            if ($pembayaran->metode_pembayaran == 'transfer') {
                if ($pembayaran->bukti_bayar != null && Storage::exists($pembayaran->bukti_bayar)) {
                    Storage::delete($pembayaran->bukti_bayar);
                }
            }

            DB::table('notifications')->where('data->pembayaran_id', $pembayaran->id)->delete();
        });